---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallStructuralUsageParam
source: html/155a20fe-7370-fc7b-88e0-274dd6bd6e46.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallStructuralUsageParam Property

"Structural Usage"

## Syntax (C#)
```csharp
public static ForgeTypeId WallStructuralUsageParam { get; }
```